{
  "personal": {
    "name": "Anmol Khandekar",
    "title": "Software Development Engineer II",
    "email": "anmol09k@gmail.com",
    "linkedin": "https://linkedin.com/in/anmol09k",
    "github": "https://github.com/anmol091192",
    "profileImage": "https://avatars.githubusercontent.com/u/52653396?v=4"
  },
  "home": {
    "title": "Anmol Khandekar",
    "subtitle": "Software Engineer · Explorer of the Digital Unknown",
    "tagLine": "Inventing new realities through curiosity, code, and cosmic inspiration.",
    "backgroundImage": "https://stsci-opo.org/STScI-01GFNN3PWJMY4RQXKZ585BC4QH.png",
    "imageOverlay": {
      "title": "Pillars of Creation",
      "description": "Captured by the James Webb Space Telescope in infrared, these iconic dust and gas columns within the Eagle Nebula are stellar nurseries hosting newborn stars. The tallest pillar spans about 4 light‑years"
    }
  },
  "about": {
    "title": "About Me",
    "subtitle": "Frontend-oriented Full-Stack Software Engineer with 6+ years of experience",
    "description": "Frontend-oriented Full-Stack Software Engineer with 6+ years of experience delivering scalable, user-centric web applications across startup and enterprise environments. Skilled in building dynamic, accessible UIs with React, TypeScript, and modern component libraries. Experienced in designing RESTful APIs, orchestrating data flows with event-driven architectures (SNS/SQS), and implementing scalable storage solutions using AWS services like DynamoDB, S3, and Lambda. Recently completed the Generative AI Specialization at Purdue University, expanding my expertise in building practical AI-powered applications and agentic workflows.",
    "skills": [
      "React", "TypeScript", "JavaScript", "Python", "Node.js", "Express", 
      "AWS", "DynamoDB", "S3", "Lambda", "SNS/SQS", "API Gateway", 
      "React Native", "Redux", "Material UI", "Next.js", "Socket.io",
      "MongoDB", "Elasticsearch", "Docker", "Git",
      "Generative AI", "Large Language Models", "Prompt Engineering", 
      "LangChain", "Transformers", "LLM Fine-Tuning", "Attention Mechanism",
      "Generative Adversarial Networks (GANs)", "Variational Autoencoders (VAEs)", 
      "Stable Diffusion", "LLM Architecture", "LLM Benchmarking", "Explainable AI"
    ],
    "backgroundImage": "https://stsci-opo.org/STScI-01GKMKRHSSCD5RKJYSB4DFH8D8.png",
    "imageOverlay": {
      "title": "Cosmic Cliffs – Carina Nebula",
      "description": "The Carina Nebula, captured by James Webb Space Telescope, reveals a stellar nursery where new stars are born. This cosmic landscape shows towering pillars of gas and dust, sculpted by stellar winds and radiation from massive young stars, creating one of the most spectacular star-forming regions in our galaxy."
    }
  },
  "experience": {
    "title": "Experience",
    "subtitle": "Professional Journey",
    "backgroundImage": "https://stsci-opo.org/STScI-01H9NWX3EYP3VJKTA68ZCQS8BS.jpg",
    "overlayTitle": "Herbig-Haro 211 – Protostellar Jet",
    "overlayDescription": "A tightly focused jet of gas blasts from a newborn star, traveling at supersonic speed. Captured by JWST in near-infrared, this image reveals the early dynamics of stellar formation.",
    "experiences": [
      {
        "company": "Amazon Web Services (AWS)",
        "position": "Software Development Engineer",
        "duration": "May 2024 – Mar 2025",
        "achievements": [
          "Designed and implemented an end-to-end allow-listing and throttling feature, deploying API Gateway configurations across multiple stages (dev, staging, prod) and AWS regions, and updated existing REST APIs to enforce these rules, ensuring compliance with customer contract terms.",
          "Enhanced and maintained storage infrastructure for catalogs and documents in the AWS Marketplace, leveraging DynamoDB for metadata management and S3 for document storage while integrating SNS and SQS to sync changes from DynamoDB to Elasticsearch, improving scalability and retrieval efficiency.",
          "Implemented batch writes with DynamoDB transactions to streamline workflows and eliminate stale data, ensuring consistent updates across related records in the database.",
          "Developed and maintained notification services for the AWS Marketplace using Amazon SES for email delivery, integrated with SQS, SNS, and EventBridge to enable real-time, event-driven customer updates.",
          "Automated stack policy updates using AWS CDK, reducing manual development time from 1.5 days to 5 minutes per deployment, enhancing operational efficiency."
        ]
      },
      {
        "company": "Linqia",
        "position": "Software Engineer",
        "duration": "Sept 2021 – Apr 2024",
        "achievements": [
          "Led the transition of frontend business logic to a Node server, enhancing system performance and reducing load times in collaboration with a junior engineer.",
          "Enhanced search precision in Frontend and Node.js, achieving a 60% reduction in latency through Node.js optimization.",
          "Developed Python CRUD endpoints using the Bottle framework, improving workflow processes and system responsiveness. Integrated the Python backend server with NodeJS for streamlined server-side operations.",
          "Built NodeJS and Express API endpoints for pagination, sorting, and filtering, optimizing data management.",
          "Implemented an infinite scroll feature on the search page, enhancing the user experience and efficiency in searching for influencers.",
          "Implemented pagination and additional features for content sharing, leading to faster data retrieval and improved user interaction.",
          "Utilized socket.io to establish real-time communication between the Frontend and Backend servers, enabling the delivery of instant notifications to users."
        ]
      },
      {
        "company": "Egen Solutions",
        "position": "Software Developer",
        "duration": "Mar 2019 – Sept 2021",
        "achievements": [
          "Worked on cart, checkout, auto-reorder, and order confirmation pages, creating new components using React, Handlebars, jQuery, and vanilla Javascript.",
          "Handled login and guest phases, contributing to a seamless user experience.",
          "Utilized Sauce Labs for testing and optimization to achieve consistent cross-platform performance, ensuring consistent functionality and user experience across Chrome, Firefox, Safari, IE and Edge.",
          "Contributed to UI design and implementation for the ordering system using React, enhancing user interface efficiency and responsiveness.",
          "Developed key features for the mobile application in React Native, ensuring a seamless and user-friendly mobile experience.",
          "Implemented functionality for generating PDF receipts for orders, accessible both on the UI and the mobile app, providing customers with detailed and convenient transaction records.",
          "Created UI for monitoring and controlling traffic security cameras using React, Redux, and Material UI.",
          "Utilized HLS.js for live streaming security camera footage, contributing to a comprehensive security solution.",
          "Utilized Next.js for server-side rendering and efficient data fetching from backend services."
        ]
      }
    ]
  },
  "projects": {
    "title": "Projects",
    "subtitle": "Featured Work",
    "backgroundImage": "https://stsci-opo.org/STScI-01JY2AZA9GFMFRKWNTG0HYB8KN.jpg",
    "overlayTitle": "Cat’s Paw Nebula (NGC 6334)",
    "overlayDescription": "Tucked 4,000 light-years away in the constellation Scorpius, the Cat’s Paw Nebula reveals a turbulent nursery of young stars clawing their way into existence. Captured by the James Webb Space Telescope’s near-infrared gaze, this view peels back a glowing “toe bean” of gas and dust — unveiling newborn stars carving luminous paths through the cloud. What you see is a chapter mid-creation: brilliant, short-lived stars sculpt the surrounding chaos, glowing blue as they disrupt and eventually silence further star formation. This richly layered scene offers not just beauty, but clues to how stars — and perhaps worlds — begin.",
    "projects": [
    {
        "name": "Portfolio",
        "description": "A modern, space-themed portfolio website showcasing my professional journey as a Software Engineer. Features immersive parallax scrolling effects, interactive animations, and a comprehensive display of experience, projects, and certifications with a cosmic design inspired by James Webb Space Telescope imagery.",
        "features": [
          "Immersive Parallax Scrolling: Dynamic depth effects across all sections with JWST space imagery",
          "Glass-morphism Design: Modern UI with frosted glass effects and cosmic aesthetics",
          "Interactive Navigation: Collapsible scroll-spy navigation with smooth animations",
          "Certificate Showcase: Professional AI certifications with PDF downloads and detailed skill listings",
          "Contact Integration: EmailJS-powered contact form with resume download functionality",
          "Responsive Design: Fully responsive across all devices with Tailwind CSS",
          "Performance Optimized: Production-ready build with SEO optimization and fast loading",
          "Professional Branding: Cohesive space theme reflecting innovation and exploration mindset"
        ],
        "techStack": ["React 19", "Tailwind CSS", "EmailJS", "Framer Motion", "JavaScript", "HTML5", "CSS3", "Netlify"],
        "githubUrl": "https://github.com/anmol091192/Portfolio_2025",
        "deploymentUrl": "https://anmolkhandekar.netlify.app/"
      },
      {
        "name": "InsightForge: AI Business Intelligence Q&A",
        "description": "An intelligent business intelligence application that allows users to upload their data (CSV or PDF) and ask natural language questions to get insights powered by AI. Combines retrieval-augmented generation (RAG) with AI agents for accurate, context-aware answers.",
        "features": [
          "Multi-format Data Support: Upload CSV files or PDF documents",
          "Flexible AI Provider Selection: Choose between Google Gemini and OpenAI GPT models",
          "User-Provided API Keys: Secure approach with session-only storage",
          "Provider-Specific Embeddings: Automatic selection based on chosen provider",
          "Intelligent Agent System: Combines document retrieval with web search",
          "Automatic Evaluation: Built-in evaluation for CSV-based queries",
          "Interactive Visualizations: Automatic charts and graphs for sales data",
          "Chat History: Persistent conversation history for better context",
          "Real-time Processing: Fast document processing with FAISS vector indexing"
        ],
        "techStack": ["Python", "Streamlit", "LangChain", "FAISS", "OpenAI", "Google Gemini", "Matplotlib", "Pandas"],
        "githubUrl": "https://github.com/anmol091192/InsightForge-AI-Business-Intelligence-Q-A",
        "deploymentUrl": "https://insightforge-ai-business-intelligence.streamlit.app/"
      },
      {
        "name": "NewsGenie: AI News & Web Search Assistant",
        "description": "AI-powered Streamlit app that lets you chat with a smart assistant to get latest news headlines by category or search the web for answers. Features robust workflow with error handling and powered by Google Gemini, GNews API, and Serper search.",
        "features": [
          "AI Chatbot: Handles news and generic information queries in natural language",
          "News Integration: Fetches real-time news using GNews API",
          "Web Search: Answers factual questions via Serper Google Search API",
          "LangGraph Workflow: Node-based decision routing for reliable query handling",
          "User-Friendly API Key Input: Secure interface for Gemini API key",
          "Robust Error Handling: Graceful fallbacks for network issues",
          "Interactive UI: Clean Streamlit interface with conversation history",
          "Smart Input Handling: Either text query OR news category, not both"
        ],
        "techStack": ["Python", "Streamlit", "AutoGen", "LangGraph", "Google Gemini", "GNews API", "Serper API"],
        "githubUrl": "https://github.com/anmol091192/NewsGenie-AI-News-Search-Assistant",
        "deploymentUrl": "https://newsgenie-ai-news-search-assistant.streamlit.app/"
      },
      {
        "name": "AI PDF Assistant - Universal PDF Chatbot",
        "description": "A Gradio-based chatbot that can answer questions about any PDF document using RAG (Retrieval Augmented Generation). Upload your own PDF files and get instant AI-powered answers with semantic search capabilities.",
        "features": [
          "AI-powered chat interface using OpenAI's GPT-3.5-turbo",
          "Upload any PDF document through the web interface",
          "Semantic search through document chunks using ChromaDB",
          "User-friendly Gradio web interface with file upload",
          "Real-time question answering about uploaded documents",
          "Secure API key management with environment variables",
          "Automatic fallback to demo mode if no PDF is uploaded",
          "Support for multiple document formats and sizes"
        ],
        "techStack": ["Python", "Gradio", "OpenAI GPT", "ChromaDB", "LangChain", "RAG"],
        "githubUrl": "https://github.com/anmol091192/AI_PDF_Chatbot",
        "deploymentUrl": null
      }
    ]
  },
  "certificates": {
    "title": "Certificates",
    "description": "Continuous learning and professional development through industry-recognized certifications",
    "backgroundImage": "https://stsci-opo.org/STScI-01HMBZMMFW050HSEVKPN5E6S5W.png",
    "statsLabels": {
      "total": "Total Certs",
      "active": "Active",
      "recent": "Recent"
    },
    "overlayTitle": "Face-on spiral galaxy, NGC 4254",
    "overlayDescription": "This face-on spiral galaxy, NGC 4254, is revealed through a cosmic lens of contrast: one half glowing in infrared from the James Webb Space Telescope, the other captured in visible and ultraviolet by Hubble. Together, they expose an interplay of light and shadow — where dust obscures starlight in one view and radiates it in another.",
    "certifications": [
      {
        "name": "Applied Generative AI Specialization",
        "issuer": "Purdue University Online & Simplilearn",
        "issueDate": "2025-07-29",
        "expiryDate": null,
        "credentialId": "156461861",
        "credentialUrl": "https://success.simplilearn.com/8c67c4dd-9279-447d-b333-bc2ccce6e197#acc.yL9dPYts",
        "skills": [
          "Python Programming", "Prompt Engineering", "Variational Autoencoders (VAEs)",
          "Generative Adversarial Networks (GANs)", "Transformers", "LLM Architecture", "Attention Mechanism",
          "Langchain for Workflow Design", "GenAI Application Development", "LLM Fine-Tuning", 
          "LLM Benchmarking", "Stable Diffusion"
        ],
        "description": "Comprehensive program covering cutting-edge generative AI concepts including prompt engineering, large language models, attention mechanisms, and LLM fine-tuning. Mastered in-demand tools for building intelligent systems and AI applications.",
        "logoUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/95/Purdue_Boilermakers_logo.svg/512px-Purdue_Boilermakers_logo.svg.png",
        "verified": true,
        "certificatePdf": "/assets/certificates/Purdue_CourseCompletion_Certificate.pdf"
      },
      {
        "name": "Building Large Language Models",
        "issuer": "Purdue University Online & Simplilearn",
        "issueDate": "2025-07-29",
        "expiryDate": null,
        "credentialId": "PU-LLM-2025",
        "credentialUrl": "https://success.simplilearn.com/profile/anmolkhandekar321974/wallet",
        "skills": [
          "Large Language Models", "LLM Architecture", "Neural Network Design", "Training Methodologies",
          "Model Optimization", "Transformer Architecture", "Attention Mechanisms", "Pre-training Techniques",
          "Fine-tuning Strategies", "Model Evaluation", "LLM Deployment"
        ],
        "description": "Advanced course focused on building and training large language models from scratch. Covered architectural design, training methodologies, optimization techniques, and deployment strategies for enterprise-scale LLM applications.",
        "logoUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/95/Purdue_Boilermakers_logo.svg/512px-Purdue_Boilermakers_logo.svg.png",
        "verified": true,
        "certificatePdf": "/assets/certificates/Purdue_BuildingLLM_certificate.pdf"
      },
      {
        "name": "GenAI Capstone Project",
        "issuer": "Purdue University Online & Simplilearn",
        "issueDate": "2025-07-29",
        "expiryDate": null,
        "credentialId": "PU-CAPSTONE-2025",
        "credentialUrl": "https://success.simplilearn.com/profile/anmolkhandekar321974/wallet",
        "skills": [
          "End-to-End AI Development", "Project Management", "AI Solution Architecture", "Real-world Implementation",
          "Stakeholder Communication", "Performance Optimization", "Model Integration", "Production Deployment",
          "Technical Documentation", "User Experience Design", "AI Ethics Implementation"
        ],
        "description": "Culminating capstone project demonstrating practical application of generative AI concepts through a comprehensive real-world solution. Integrated multiple AI technologies to solve complex business challenges with measurable impact.",
        "logoUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/95/Purdue_Boilermakers_logo.svg/512px-Purdue_Boilermakers_logo.svg.png",
        "verified": true,
        "certificatePdf": "/assets/certificates/Purdue_Capstone_Certificate.pdf"
      },
      {
        "name": "AI Models and Architecture",
        "issuer": "Purdue University Online & Simplilearn",
        "issueDate": "2025-07-29",
        "expiryDate": null,
        "credentialId": "PU-MODELS-2025",
        "credentialUrl": "https://success.simplilearn.com/profile/anmolkhandekar321974/wallet",
        "skills": [
          "AI Model Architecture", "Model Selection",
          "Architecture Patterns", "Computational Efficiency", "Scalability Design", "Model Comparison",
          "Performance Benchmarking", "Architecture Optimization", "Multi-modal Systems"
        ],
        "description": "Comprehensive study of AI model architectures covering design principles, performance optimization, and scalability considerations. Explored various architectural patterns and their applications in real-world AI systems.",
        "logoUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/95/Purdue_Boilermakers_logo.svg/512px-Purdue_Boilermakers_logo.svg.png",
        "verified": true,
        "certificatePdf": "/assets/certificates/Purdue_ModelAndArchitecture_Certificate.pdf"
      },
      {
        "name": "Python Programming Basics",
        "issuer": "Purdue University Online & Simplilearn",
        "issueDate": "2025-07-29",
        "expiryDate": null,
        "credentialId": "PU-PYTHON-2025",
        "credentialUrl": "https://success.simplilearn.com/profile/anmolkhandekar321974/wallet",
        "skills": [
          "Python Programming", "Data Structures", "Object-Oriented Programming", "Error Handling",
          "File Operations", "Libraries and Modules", "Python for AI/ML"
        ],
        "description": "Foundational course covering Python programming fundamentals, data structures, OOP concepts, and essential libraries for AI/ML development as part of the Applied Generative AI Specialization.",
        "logoUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/95/Purdue_Boilermakers_logo.svg/512px-Purdue_Boilermakers_logo.svg.png",
        "verified": true,
        "certificatePdf": "/assets/certificates/Purdue_PythonBasics_Certificate.pdf"
      }
    ]
  },
  "contact": {
    "title": "Let's Connect",
    "subtitle": "Ready to collaborate or discuss opportunities? I'd love to hear from you!",
    "backgroundImage": "https://stsci-opo.org/STScI-01H82GANSY85GHFY3Y2FN9R65P.png",
    "socialLinks": {
      "linkedin": "https://linkedin.com/in/anmol09k",
      "github": "https://github.com/anmol091192"
    },
    "imageOverlay": {
      "title": "Ring Nebula",
      "description": "Located just 2,500 light-years away, the Ring Nebula is the luminous echo of a dying star — its outer layers cast adrift as fuel runs dry. Captured in remarkable detail by James Webb's NIRCam, this planetary nebula becomes a cosmic fossil: glowing gas, dense hydrogen globules, and carbon-rich rings spiraling outward like time's own signature. Each glowing arc and filament maps the final moments of a once-sunlike star. From its carbon-based halo to its mysterious concentric ripples — likely shaped by a hidden companion — this nebula reveals the quiet complexity of stellar endings, and the chemical legacy they leave behind."
    },
    "sections": {
      "email": {
        "title": "Email",
        "icon": "email"
      },
      "resume": {
        "title": "Resume",
        "buttonText": "Download Resume",
        "icon": "download"
      },
      "social": {
        "title": "Connect",
        "links": [
          {
            "name": "LinkedIn",
            "url": "https://linkedin.com/in/anmol09k",
            "color": "blue"
          },
          {
            "name": "GitHub",
            "url": "https://github.com/anmol091192",
            "color": "gray"
          }
        ]
      },
      "form": {
        "title": "Send Me a Message",
        "fields": {
          "name": "Your Name",
          "email": "Your Email",
          "subject": "Subject",
          "message": "Your message...",
          "rating": "Rate your experience (optional)",
          "review": "Share your thoughts about working with me (optional)"
        },
        "submitButton": "Send Message",
        "successMessage": "Thank you for your message! I'll get back to you soon."
      }
    }
  },
  "navigation": {
    "sections": ["contact", "certificates", "projects", "experience", "about", "home"],
    "sectionLabels": {
      "home": "Home",
      "about": "About",
      "experience": "Experience",
      "projects": "Projects",
      "certificates": "Certificates",
      "contact": "Contact"
    }
  },
  "ui": {
    "buttons": {
      "showMore": "Show More",
      "showLess": "Show Less",
      "viewDemo": "View Demo",
      "viewCode": "View Code",
      "viewCredential": "View Credential"
    },
    "labels": {
      "skills": "Skills",
      "technologies": "Technologies",
      "issued": "Issued",
      "expires": "Expires",
      "active": "Active",
      "expired": "Expired",
      "verified": "Verified",
      "totalCerts": "Total Certs",
      "recent": "Recent"
    },
    "placeholders": {
      "searchProjects": "Search projects...",
      "filterByTech": "Filter by technology..."
    }
  }
}
